content/docs/docs/ROS-doc/3-RaceCarNotes.org
#+TITLE: ROS 无人小车项目
#+DATE: <2022-11-11 Fri>
#+AUTHOR: EndlessPeak
#+TOC: true
#+HIDDEN: false
#+DRAFT: false
#+WEIGHT: 4 
#+Description: 本文主要记录ROS小车比赛项目的进展和相关笔记。

* Project
** Init Project
从 github 上克隆代码，以此作为工作目录，克隆完成后进入工作目录。
#+begin_src shell
  git clone https://github.com/endlesspeak/rosracecar Racecar_ws
  cd Racecar_ws
#+end_src

配置环境变量，以便每次启动项目不必切换到工作目录。编辑 =~/.bashrc=
#+begin_src shell
  source ~/Racecar_ws/devel/setup.bash
#+end_src

** Run Project
通过键盘控制测试小车，开启三个标签终端，依次执行下面的命令。
#+begin_src shell
  roslaunch bringup racecar.launch
  rosrun racecar_description servo_commands.py
  rosrun racecar_description keyboard_teleop.py
#+end_src
